CONTRIBUTING.org
* Files
** Firmware
*** [[https://github.com/probe-rs/probe-rs][probe-rs]]

#+begin_src toml :tangle .probe-rs.toml
[presets.default]
speed = 40000
chip = "esp32s3"
always-print-stacktrace = true
# idf-partition-table = "boards/esp32s3.partitions.csv"
log-format = "{[{L:bold:green:4}]%bold} {s:bold:white} :: {ff:bold:magenta}:{l:bold:cyan}"

[presets.esp32-s3-devkitc-1]
chip = "esp32s3"
host = "ws://rpi5-16:8443"
probe = "303a:1001:1C:DB:D4:40:4E:38"
token = "rpi5-16"

[presets.seeed_xiao_esp32s3]
chip = "esp32s3"
probe = "303a:1001:D8:3B:DA:74:82:E8"

[presets.stm32h723zg]
always-print-stacktrace = true
chip = "stm32h723zg"
preverify = true

[server]
address = "rpi5-16"
port = 8443

[[server.users]]
name = "mfarabi"
token = "rpi5-16"
#+end_src

*** [[https://github.com/probe-rs/cargo-embed][cargo-embed]]

#+begin_src toml :tangle Embed.toml
[default.general]
chip        = "esp32s3"

[default.probe]
protocol    = "Jtag"

[default.rtt]
enabled     = true
timeout     = 3000
log_enabled = false
up_channels = [
    { channel = 0, mode = "BlockIfFull", format = "Defmt", show_location = true },
]

down_channels = [
    { channel = 0, mode = "BlockIfFull" },
]

[default.flashing]
enabled                 = true
restore_unwritten_bytes = true

[default.reset]
enabled                 = true
halt_afterwards         = false

[default.gdb]
enabled                 = false
#+end_src

*** [[https://github.com/esp-rs/espflash][espflash]]

#+begin_src toml :tangle espflash.toml
[idf_format_args]
target_app_partition = "ota_0"
partition_table = "boards/esp32s3.partitions.csv"
#+end_src

*** [[https://doc.rust-lang.org/cargo/reference/manifest.html#the-rust-toolchain-file][rust-toolchain.toml]]
#+begin_src toml :tangle firmware/rust-toolchain.toml
[toolchain]
channel = "esp"
profile = "minimal"
# channel = "stable"

components = [
    "rustc",
    "cargo",
    "clippy",
    "rustfmt",
    "rust-src",
    "rust-analyzer",
    "rustfmt",
]

targets = [
    "thumbv6m-none-eabi",
    "thumbv7em-none-eabihf",
    "thumbv8m.main-none-eabihf",
    "riscv32imac-unknown-none-elf",
]
#+end_src

*** [[https://doc.rust-lang.org/clippy/configuration.html][clippy.toml]]
#+begin_src toml :tangle firmware/clippy.toml
stack-size-threshold = 1024
# stack-size-threshold = 8196 # cyd
#+end_src

*** platformio

#+begin_src conf :tangle platformio.ini
[platformio]
name         = microvisor
default_envs = p-uot-ins

lib_dir      = libs
test_dir     = test
data_dir     = firmware/data

[env]
framework         =  arduino
platform          =  espressif32

monitor_echo      =  True

lib_ldf_mode      =  chain
lib_compat_mode   =  strict

# monitor_speed     =  115200
# monitor_rts       =  0
# monitor_dtr       =  0
# monitor_port      =  /dev/cu.usbmodem101
# monitor_filters   =  direct

# test_speed        =  115200
upload_speed      =  921600
build_src_filter  =  +<*>, -<*.rs>, -<.git/>, -<.svn/>, -<**/*.rs>

[env:ceratina]
board                   =  esp32-s3-devkitc-1
board_build.filesystem  =  littlefs
# build_flags             =
#   -DARDUINO_USB_MODE=1
#   -DMONITOR_SPEED=115200
#   -DARDUINO_USB_CDC_ON_BOOT=1

#   -DCONFIG_HTTP_DEBUG_ENABLED=0

#   -DCONFIG_WIFI_OTA_ENABLED=1
#   -DCONFIG_WIFI_OTA_TIMEOUT_MS=10000
#   -DCONFIG_WIFI_CONNECT_TIMEOUT_MS=15000
#   -DCONFIG_WIFI_DEFAULT_HOSTNAME=\"ceratina\"

#   -DCONFIG_NTP_SYNC_TIMEOUT_MS=5000
#   -DCONFIG_NTP_SYNC_POLL_DELAY_MS=100
#   -DCONFIG_NTP_SERVER=\"pool.ntp.org\"
#   -DCONFIG_NTP_TIMEZONE_INFO=\"EST5EDT,M3.2.0/2,M11.1.0/2\"

#   -DCONFIG_SMTP_PORT=1025
#   -DCONFIG_SMTP_SSL_ENABLED=0
#   -DCONFIG_SMTP_TEST_ENABLED=1
#   -DCONFIG_SMTP_AUTH_ENABLED=0
#   -DCONFIG_SMTP_STARTTLS_ENABLED=0
#   -DCONFIG_SMTP_LOGIN_EMAIL=\"\"
#   -DCONFIG_SMTP_HOST=\"10.0.0.198\"
#   -DCONFIG_SMTP_DOMAIN=\"localhost\"
#   -DCONFIG_SMTP_FROM_NAME=\"ceratina\"
#   -DCONFIG_SMTP_NOTIFY=\"SUCCESS,FAILURE,DELAY\"
#   -DCONFIG_SMTP_SUBJECT_PREFIX=\"[ceratina-test]\"
#   -DCONFIG_SMTP_TO_EMAIL=\"farabi@apidaesystems.ca\"
#   -DCONFIG_SMTP_FROM_EMAIL=\"ceratina-test@apidaesystems.local\"

#   -DCONFIG_WEBHOOK_ENABLED=0
#   -DCONFIG_WEBHOOK_URL=\"\"
#   -DCONFIG_WEBHOOK_DEBUG_ENABLED=1
#   -DCONFIG_WEBHOOK_TIMEOUT_MS=7000
#   -DCONFIG_WEBHOOK_METHOD=\"POST\"
#   -DCONFIG_WEBHOOK_AVATAR_URL=\"\"
#   -DCONFIG_WEBHOOK_AUTH_HEADER=\"\"
#   -DCONFIG_WEBHOOK_MAX_RESPONSE_BYTES=512
#   -DCONFIG_WEBHOOK_USERNAME=\"ceratina\"
#   -DCONFIG_WEBHOOK_CONTENT_PREFIX=\"[ceratina]\"
#   -DCONFIG_WEBHOOK_CONTENT_TYPE=\"application/json\"

#   -DCONFIG_I2C_BUS_0_SDA_GPIO=15
#   -DCONFIG_I2C_BUS_0_SCL_GPIO=16
#   -DCONFIG_I2C_BUS_1_SDA_GPIO=17
#   -DCONFIG_I2C_BUS_1_SCL_GPIO=18
#   -DCONFIG_I2C_INIT_DELAY_MS=1000
#   -DCONFIG_I2C_FREQUENCY_HZ=100000

#   -DCONFIG_RELAY_MOSFET_POWER_GPIO_PIN=5
#   -DCONFIG_RS485_CHANNEL_COUNT=2
#   -DCONFIG_RS485_BUS_0_TX_GPIO=45
#   -DCONFIG_RS485_BUS_0_RX_GPIO=48
#   -DCONFIG_RS485_BUS_0_DE_RE_GPIO=47
#   -DCONFIG_RS485_BUS_0_BAUD_RATE=9600
#   -DCONFIG_RS485_BUS_1_TX_GPIO=40
#   -DCONFIG_RS485_BUS_1_RX_GPIO=39
#   -DCONFIG_RS485_BUS_1_DE_RE_GPIO=41
#   -DCONFIG_RS485_BUS_1_BAUD_RATE=4800

#   -DCONFIG_SOIL_PROBE_COUNT=20
#   -DCONFIG_SOIL_LAST_SLAVE_ID=72
#   -DCONFIG_SOIL_FIRST_SLAVE_ID=53
#   -DCONFIG_SOIL_PROBE_DELAY_MS=50

#   -DCONFIG_MODULE_WIND_SPEED_SLAVE_ID=20
#   -DCONFIG_MODULE_WIND_SPEED_RS485_CHANNEL=0
#   -DCONFIG_MODULE_WIND_SPEED_REGISTER_ADDRESS=0

#   -DCONFIG_WIND_SENSOR_DELAY_MS=100

#   -DCONFIG_MODULE_WIND_DIRECTION_SLAVE_ID=1
#   -DCONFIG_MODULE_WIND_DIRECTION_RS485_CHANNEL=0
#   -DCONFIG_MODULE_WIND_DIRECTION_REGISTER_ADDRESS=0

#   -DCONFIG_MODULE_SOLAR_RADIATION_SLAVE_ID=40
#   -DCONFIG_MODULE_SOLAR_RADIATION_RS485_CHANNEL=0
#   -DCONFIG_MODULE_SOLAR_RADIATION_REGISTER_ADDRESS=0

#   -DCONFIG_MODULE_CURRENT_MONITOR_SHUNT_RESISTANCE_OHMS=0.015
#   -DCONFIG_MODULE_CURRENT_MONITOR_MAX_EXPECTED_CURRENT=10.0

#   -DCONFIG_TEMPERATURE_AND_HUMIDITY_0_I2C_ADDRESS=68
#   -DCONFIG_TEMPERATURE_AND_HUMIDITY_1_I2C_ADDRESS=68
#   -DCONFIG_TEMPERATURE_AND_HUMIDITY_RESET_GPIO_PIN=4
#+end_src

**** Other
ESP32-S3 flash is 8MB, divided into a dual-OTA layout for safe over-the-air updates.
The bootloader checks =otadata= to decide whether to boot from =ota_0= or =ota_1=.
A new firmware image is written to the *inactive* slot, then =otadata= is flipped.
If the new image fails to boot, the bootloader rolls back automatically.

| Partition | Offset   | Size  | Purpose                                           |
|-----------+----------+-------+---------------------------------------------------|
| =nvs=       | =0x9000=   | 16 KB | Non-volatile storage (WiFi credentials, settings) |
| =otadata=   | =0xD000=   | 8 KB  | Tracks which OTA slot is active                   |
| =phy_init=  | =0xF000=   | 4 KB  | RF calibration data for WiFi/BLE                  |
| =ota_0=     | =0x10000=  | ~4 MB | Primary firmware slot                             |
| =ota_1=     | =0x400000= | 4 MB  | Secondary firmware slot (OTA target)              |

#+begin_src csv :tangle boards/esp32s3.partitions.csv
# https://docs.espressif.com/projects/esp-idf/en/stable/esp32s3/api-guides/partition-tables.html

# Name,   Type, SubType, Offset,   Size,     Flags
nvs,      data, nvs,     0x9000,   0x4000,
otadata,  data, ota,     0xd000,   0x2000,
phy_init, data, phy,     0xf000,   0x1000,
ota_0,    app,  ota_0,   0x10000,  0x3F0000,
ota_1,    app,  ota_1,   0x400000, 0x400000,
#+end_src


** [[https://sourceware.org/binutils/docs/ld/MEMORY.html][memory.stm32.x]]
#+begin_src fundamental :tangle firmware/memory.stm32.x
MEMORY
{
FLASH : ORIGIN = 0x08000000, LENGTH = 1024K
RAM   : ORIGIN = 0x20000000, LENGTH = 128K
}
#+end_src
#+begin_SRC .gitignore :tangle .gitignore
#====================================================
#              🏗 BUILD/TEST OUTPUTS 🏗
#====================================================
# .dir-locals.el
**/.pio/
**/debug/
**/result
**/zig-out
**/target/
**/dist
assets/static/tui.js
assets/static/index.html
assets/static/tui_bg.wasm
.shellspec
**/node_modules
tests/env_spec.sh
learning/assembly/build/
config/data.sqld

#====================================================
#                 CACHES/LOGS
#====================================================
logs # MSVC Windows builds of rustc generate these, which store debugging information
*.pdb
.cache
.devenv*
.direnv
*.sqlite
*.sqlite-*
**/*.qcow2
**/.direnv/
**/*.rs.bk
.open-webui
**/.git-hooks
**/.zig-cache
devenv.local.nix
devenv.local.yaml
local.properties
.webui_secret_key
.pre-commit-config.yaml

#====================================================
#                  MISCELLANEOUS
#====================================================
.c9
*.pem
*tmp*
.idea/
.project
*.launch
.vscode/*
.DS_Store
.settings
.classpath
!.vscode/settings.json
!.vscode/extensions.json
!.vscode/settings-example.json

#====================================================
#                  DEPENDENCIES
#====================================================
/.pnp
.pnp.js

opencode.json
/.codex/config.toml
/compile_commands.json
#+END_SRC

